# MepElecZoneEquipmentType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepElecZoneEquipmentType Property
ParameterTypeId Class See Also
---
"Equipment Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepElecZoneEquipmentType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepElecZoneEquipmentType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepElecZoneEquipmentType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace